Tekla Open API Reference for Tekla Structures 2025
BoltGroup.RotateSlots Property
 Gets or sets the rotation of the slots: odd, even or parallel.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltGroup.BoltRotateSlotsEnum RotateSlots { get; set; }
Public Property RotateSlots As BoltGroup.BoltRotateSlotsEnum
	Get
	Set
Property Value
Type: BoltGroup.BoltRotateSlotsEnum
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace